wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_mdma.h
/* MDMA_CHxMBADDRU,x=0..15 */
#define MDMA_CHXMBADDRU_SADDRUV             BITS(0,15)                                                /*!< source address update value */
#define MDMA_CHXMBADDRU_DADDRUV             BITS(16,31)                                               /*!< destination address update value */

/* MDMA_CHxLADDR,x=0..15 */
#define MDMA_CHXLADDR_LADDR                 BITS(0,31)                                                /*!< link address */

/* MDMA_CHxCTL1,x=0..15 */
#define MDMA_CHXCTL1_TRIGSEL                BITS(0,5)                                                 /*!< trigger select */
#define MDMA_CHXCTL1_SBSEL                  BIT(16)                                                   /*!< source bus select */
#define MDMA_CHXCTL1_DBSEL                  BIT(17)                                                   /*!< destination bus select */ 

/* MDMA_CHxMADDR,x=0..15 */
#define MDMA_CHXMADDR_MADDR                 BITS(0,31)                                                /*!< mask address */

/* MDMA_CHxMDATA,x=0..15 */
#define MDMA_CHXMDATA_MDATA                 BITS(0,31)                                                /*!< mask data */

/* constants definitions */
/* define the USART bit position and its register index offset */
#define MDMA_REGIDX_BIT(regidx, bitpos)      (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define MDMA_REG_VAL(mdma_chx, offset)       (REG32(MDMA + (((uint32_t)(offset) & 0x0000FFFFU) >> 6) + (0x40U * (mdma_chx))))
#define MDMA_BIT_POS(val)                    ((uint32_t)(val) & 0x0000001FU)
#define MDMA_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
                                                              | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define MDMA_REG_VAL2(mdma_chx, offset)      (REG32(MDMA + (((uint32_t)(offset) & 0xFFFF0000U) >> 22) + (0x40U * (mdma_chx))))
#define MDMA_BIT_POS2(val)                   (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define MDMA_STAT0_REG_OFFSET                ((uint32_t)0x00000040U)        /*!< STAT0 register offset */
#define MDMA_STAT1_REG_OFFSET                ((uint32_t)0x00000048U)        /*!< STAT1 register offset */
#define MDMA_CTL0_REG_OFFSET                 ((uint32_t)0x0000004CU)        /*!< CTL0 register offset */

/* MDMA configuration structure definition */
typedef struct {            
    uint32_t request;                                                                                       /*!< specifies the MDMA request */
    uint32_t trans_trig_mode;                                                                               /*!< specifies the trigger transfer mode */
    uint32_t priority;                                                                                      /*!< specifies the software priority for the MDMA channelx */
    uint32_t endianness;                                                                                    /*!< specifies if the MDMA transactions preserve the little endianness */
    uint32_t source_inc;                                                                                    /*!< specifies the source increment mode */
    uint32_t dest_inc;                                                                                      /*!< specifies the destination increment mode */
    uint32_t source_data_size;                                                                              /*!< specifies the source data size */
    uint32_t dest_data_size;                                                                                /*!< specifies the destination data size */
    uint32_t data_alignment;                                                                                /*!< specifies the source to destination memory data packing/padding mode */
    uint32_t buff_trans_len;                                                                                /*!< specifies the buffer transfer length (number of bytes) */
    uint32_t source_burst;                                                                                  /*!< specifies the burst transfer configuration for the source memory transfers */
    uint32_t dest_burst;                                                                                    /*!< specifies the burst transfer configuration for the destination memory transfers */
    uint32_t mask_addr;                                                                                     /*!< mask address */
    uint32_t mask_data;                                                                                     /*!< mask data */
    uint32_t source_addr;                                                                                   /*!< specifies the source address */
    uint32_t destination_addr;                                                                              /*!< specifies the destination address */
    uint32_t tbytes_num_in_block;                                                                           /*!< specifies the transfer bytes number in a buffer or block transfer */
    uint32_t source_bus;                                                                                    /*!< specifies the source bus */
    uint32_t destination_bus;                                                                               /*!< specifies the destination bus */
    uint32_t bufferable_write_mode;                                                                         /*!< specifies the bufferable write mode */
} mdma_parameter_struct;

/* MDMA address update direction */
typedef enum {
    UPDATE_DIR_INCREASE = 0,                                                                                /*!< MDMA address update increase */
    UPDATE_DIR_DECREASE = 1,                                                                                /*!< MDMA address update decrease */
} mdma_add_update_dir_enum;

/* MDMA multi block transfer configuration structure definition */
typedef struct {
    uint32_t block_num;                                                                                     /*!< multi-block number */
    uint16_t saddr_update_val;                                                                              /*!< source address update value */
    uint16_t dstaddr_update_val;                                                                            /*!< destination address update value */
    mdma_add_update_dir_enum saddr_update_dir;                                                              /*!< source address update direction */
    mdma_add_update_dir_enum dstaddr_update_dir;                                                            /*!< destination address update direction */
} mdma_multi_block_parameter_struct;

